Revit 2023 API
GroupTypeId.RailingSystemFamilySegmentPattern Property
 "Segment Pattern (default)"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Syntax
C#
public static ForgeTypeId RailingSystemFamilySegmentPattern { get; }
Visual Basic
Public Shared ReadOnly Property RailingSystemFamilySegmentPattern As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ RailingSystemFamilySegmentPattern {
	ForgeTypeId^ get ();
}
See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace